InformationRegisters/ЭАрМ_НастройкиЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭАрМ_НастройкиЭДО</Name>
			<Comment>Настройки обмена ЭДО между УТ и Далион</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЭАрМ_НастройкиСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает значение настройки из регистра.
//
// Параметры:
//   Ключ - Строка - ключ настройки
//
// Возвращаемое значение:
//   Строка, Булево, Неопределено - значение настройки
//
Функция ПолучитьНастройку(Ключ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Значение КАК Значение,
	|	Т.ЗначениеБулево КАК ЗначениеБулево
	|ИЗ
	|	РегистрСведений.ЭАрМ_НастройкиЭДО КАК Т
	|ГДЕ
	|	Т.КлючНастройки = &Ключ";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	Если Выборка.ЗначениеБулево = Истина Тогда
		Возврат Истина;
	ИначеЕсли Выборка.ЗначениеБулево = Ложь И НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Выборка.Значение;

КонецФункции

// Сохраняет значение настройки в регистр.
//
// Параметры:
//   Ключ - Строка - ключ настройки
//   Значение - Строка, Булево - значение настройки
//
Процедура СохранитьНастройку(Ключ, Значение) Экспорт

	Менеджер = РегистрыСведений.ЭАрМ_НастройкиЭДО.СоздатьМенеджерЗаписи();
	Менеджер.КлючНастройки = Ключ;

	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Менеджер.ЗначениеБулево = Значение;
		Менеджер.Значение = "";
	Иначе
		Менеджер.Значение = Строка(Значение);
		Менеджер.ЗначениеБулево = Ложь;
	КонецЕсли;

	Менеджер.Записать(Истина);

КонецПроцедуры

// Получает все настройки в виде структуры.
//
// Возвращаемое значение:
//   Структура - все настройки
//
Функция ПолучитьВсеНастройки() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("АдресСервисаДалион", "");
	Результат.Вставить("ИспользоватьАвтоОтправку", Ложь);
	Результат.Вставить("ТранспортОбмена", "HTTP");
	Результат.Вставить("ЛогироватьСобытия", Ложь);
	Результат.Вставить("FTP_Сервер", "");
	Результат.Вставить("FTP_Порт", "21");
	Результат.Вставить("FTP_Пользователь", "");
	Результат.Вставить("FTP_Пароль", "");
	Результат.Вставить("FTP_Каталог", "/edo");
	Результат.Вставить("ПапкаОбмена", "");
	Результат.Вставить("ТестовыйРежим", Ложь);
	Результат.Вставить("СБИС_ИспользоватьСБИС", Ложь);
	Результат.Вставить("СБИС_КлиентID", "7129936044121314");
	Результат.Вставить("СБИС_КлиентСекрет", "NR6HBCMZT66XIV45PK6PVMK");
	Результат.Вставить("СБИС_СекретныйКлюч", "777129712993604412131493604412131412993604417129937129936044121314604412131421314129936044121314");
	Результат.Вставить("СБИС_АдресСервера", "online.saby.ru");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.КлючНастройки КАК КлючНастройки,
	|	Т.Значение КАК Значение,
	|	Т.ЗначениеБулево КАК ЗначениеБулево
	|ИЗ
	|	РегистрСведений.ЭАрМ_НастройкиЭДО КАК Т";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Результат.Свойство(Выборка.КлючНастройки) Тогда
			Если Выборка.ЗначениеБулево = Истина Тогда
				Результат.Вставить(Выборка.КлючНастройки, Истина);
			ИначеЕсли ЗначениеЗаполнено(Выборка.Значение) Тогда
				Результат.Вставить(Выборка.КлючНастройки, Выборка.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Сохраняет все настройки из структуры.
//
// Параметры:
//   Настройки - Структура - настройки для сохранения
//
Процедура СохранитьВсеНастройки(Настройки) Экспорт

	Для Каждого КлючЗначение Из Настройки Цикл
		СохранитьНастройку(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

КонецПроцедуры

// Записывает статичные дефолты СБИС в регистр, если их там нет.
//
Процедура ИнициализироватьНастройкиСБИС() Экспорт

	Дефолты = Новый Структура;
	Дефолты.Вставить("СБИС_КлиентID", "7129936044121314");
	Дефолты.Вставить("СБИС_КлиентСекрет", "NR6HBCMZT66XIV45PK6PVMK");
	Дефолты.Вставить("СБИС_СекретныйКлюч", "777129712993604412131493604412131412993604417129937129936044121314604412131421314129936044121314");
	Дефолты.Вставить("СБИС_АдресСервера", "online.saby.ru");

	Для Каждого КлючЗначение Из Дефолты Цикл
		ТекущееЗначение = ПолучитьНастройку(КлючЗначение.Ключ);
		Если ТекущееЗначение = Неопределено Тогда
			СохранитьНастройку(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#Область РегламентноеЗадание

// Точка входа для регламентного задания.
// В тестовом режиме создаёт ЗаказКлиента с комментарием "ЭДОТест".
// В боевом режиме запрашивает входящие документы из СБИС.
//
Процедура ЭАрМ_РегламентноеЗадание() Экспорт

	ТестовыйРежим = ПолучитьНастройку("ТестовыйРежим");

	Если ТестовыйРежим = Истина Тогда
		// Тест: создаём ЗаказКлиента с комментарием "ЭДОТест"
		ДокОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.Комментарий = "ЭДОТест";
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);

		ЗаписьЖурналаРегистрации("АРМ_ЭДО.Тест",
			УровеньЖурналаРегистрации.Информация, , ДокОбъект.Ссылка,
			"Создан тестовый заказ ЭДО");
	Иначе
		// Боевой: запрос документов из СБИС
		ЭАрМ_ОбщийМодуль.ОбработатьДокументыСБИС();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
